#include <iostream>
#include <motorizedWheelchair.h> // подключаем хедер с описанием коляски

int main()
{
    motorizedWheelchair chair; // создаем экземпляр коляски
    chair.turnOn(); // включаем коляску, пизданули ей энергию

    int speed = 50; // задаем скорость движения нахуй
    chair.setSpeed(speed); // устанавливаем скорость, чтоб коляска не ебанулась

    std::cout << "Каталка начала движение на скорости " << speed << "%" << std::endl; // выводим сообщение о начале движения, чтоб всем было ясно, что ты теперь на коляске

    return 0; // возвращаем ноль, потому что нам похуй на все остальное
}
